class BookDetailsFromAuthors {
  static List<String> bookImage = [
    'book1.jpeg',
    'book2.jpeg',
    'book3.jpeg',
    'book4.png',
  ];

  static List<String> authorName = [
    "শাইখ আবুল হাসানাত মুহাম্মাদ ইমদাদুল্লাহ",
    "শাইখ আবুল হাসানাত মুহাম্মাদ ইমদাদুল্লাহ",
    "শাইখ আবুল হাসানাত মুহাম্মাদ ইমদাদুল্লাহ",
    "শাইখ আবুল হাসানাত মুহাম্মাদ ইমদাদুল্লাহ"
  ];

  static List<int> bookPrice = [100, 150, 340, 100];

  static List<String> bookProkashoni = [
    "আধুনিক প্রকাশনী",
    "আধুনিক প্রকাশনী",
    "আধুনিক প্রকাশনী",
    "আধুনিক প্রকাশনী"
  ];

  static List<String> bookSubject = ["", "", "", ""];
  static List<String> bookTranslator = ["", "", "", ""];
  static List<String> bookCover = [
    "পেপার ব্যাক",
    "পেপার ব্যাক",
    "পেপার ব্যাক",
    "পেপার ব্যাক"
  ];
  static List<String> bookLanguage = ["বাংলা", "বাংলা", "বাংলা", "বাংলা"];
  static List<String> bookEdition = ["১ম", "১০ম", "৫ম", "৫ম"];
  static List<int> bookTotalPage = [32, 224, 386, 120];

  static List<String> bookName = [
    "একশব্দে কুরআন শিক্ষা",
    "একশব্দে কুরআন শিখানোর সুন্দর কৌশল",
    "জিকির ও দোয়া",
    "একশব্দে হজ্জ ও উমরাহ শিক্ষা"
  ];

  static List<String> booDescription = [
    'শরীর ও আত্মার সমন্বয়ে মানুষ। আত্মা ছাড়া শরীর মূল্যহীন। তাই একজন মানুষের শরীর থেকে আত্মা বের হয়ে গেলে শরীর ঠিক থাকলেও দাফন কাফনের ব্যবস্থা করা হয়। তার হাত, পা, চোখ, মুখ, নাক, মাথা সবই ঠিক থাকে। শুধু আত্মা না থাকার কারণে দাফনে দেরি হলে সবার বুকে হাঁফ শুরু হয়ে যায়। তাড়াতাড়ি দাফন কাফনের ব্যবস্থা করা হয়। এতে প্রামাণিত হলো শুধু শরীরের নাম মানুষ নয়। শরীর ও আত্মা দুটির সমন্বয়ে মানুষ ।\nশরীরকে সুস্থ রাখতে হলে গোসত, মাছ, ডিম, দুধ, কলা, পোলাও, কোর্মা, জর্দা, বিরানি, তরিতরকারী, শাক-সবজিসহ বিভিন্ন খাবার খেতে হয়। তাও আবার সকাল, দুপুর ও রাত তিন বেলা। শরীর যেহেতু মাটির। তাই মাটির উৎপাদিত জিনিসই শরীরের জন্য উপযোগী। আমরা যত খাবার খেয়ে থাকি সবই মাটি থেকে উৎপাদিত। আর আত্মা যেহেতু মাটির নয়। মাটির উৎপাদিত খাবার আত্মার জন্য উপযোগী হতে পারে না। আত্মা এসেছে রূহের জগত থেকে। আর সে জগত থেকে যে খাবার এসেছে সে খাবার হলো আত্মার খাবার। সে জগত থেকে এসেছে আল-কুরআন । কুরআনই হচ্ছে আত্মার খাবার। এ জন্য আল্লাহ্ রাব্বুল আলামীন আমাদেরকে প্রথম যে নির্দেশ দিয়েছেন, তা হলো-',
    'প্রশিক্ষণ সফলতার চাবিকাঠি। প্রশিক্ষণ মানুষকে তেজস্বী, বলিষ্ঠ ও পরিপক্ক করে। তাই দেশে বিদেশে সর্বত্রই চলছে প্রশিক্ষণের প্রতিযোগিতা। এক দলের পর আরেক দল আসছে। প্রশিক্ষণ নিচ্ছে। বিরাম নেই। ফুরসৎ নেই। প্রশিক্ষণ ধারাবাহিকভাবে চলছেই। আলো বাতাসের মতো প্রশিক্ষণ মানুষের সাথে মিশে আছে। প্রশিক্ষণের নানান দিক। নানান বিভাগ। নানান সেকটর। সকলে চূড়ান্ত সফলতা ছিনিয়ে আনতে বদ্ধপরিকর। আর সীসাঢালা প্রাচীরের মতো মজবুত। একটা উদাহরণ দিলে বুঝ পাকা হয়ে যাবে ।\nডাক্তার প্রশিক্ষণ নিচ্ছেন শরীরের ওপর। শরীরের কতো যে বিভাগ। কূল কিনারা নেই। শরীর সম্পর্কে জানতে চিকিৎসা বিজ্ঞানীরা দিন-রাত খাটছেন। যেমন ধরুন মাথা, যাকে বলা হয় দেহ সম্রাট। এর জন্য রয়েছে আলাদা প্রশিক্ষণ। চোখ, চোখের ঝিল্লিতে নয়টি স্তর। প্রত্যেকের শুধু ভিতরের ঝিল্লি স্তরটিতে তিন কোটি দন্ড। ত্রিশ লাখ ঘনক্ষেত্র দিয়ে প্রস্তুত। এর জন্যে দেশে বিদেশে প্রশিক্ষণ চলছে। কান, অতি সূক্ষ্ম খিলানের সমন্বয়ে গঠিত। একটি অংশেই চার হাজার খিলান রয়েছে। যা একই সময়ে লাখ লাখ শব্দ বহন করে মাথায় পৌছিয়ে দিতে সক্ষম। কানের জন্য রয়েছে আলাদা প্রশিক্ষণ। এভাবে মেডিসিন, স্কিন, সার্জারী, হার্ট, গ্যাস্ট্রো এন্ডারলোজি, লিভার, প্যাথলজি, ইমোনোলজি, অর্থোপেডিক, কার্ডিয়োলোজি ও রেডিয়োলজী বিভাগসহ আরো বিভাগের ওপর প্রশিক্ষণ চলছে। শরীরের জন্য এতো বিভাগ, এতো প্রশিক্ষণ। ডাক্তার প্রশিক্ষণ নিচ্ছেন।',
    'আজ সর্বত্রই ভেজালের ছড়াছড়ি। চাল, ডাল, লবণ, মাছ-গোশত, শাকসবজি, ফলমূলসহ প্রায় সব কিছুতেই ভেজাল। যার ফলে তাল-হুঁশ হারিয়ে মানুষের বেহাল অবস্থা। ভেজালের কারণে লিভার, কিডনি, হার্টসহ দেহের গুরুত্বপূর্ণ অঙ্গ অকালে অকেজো হয়ে মারা যাচ্ছে মানুষ ।\nআমার মনে হয় ইসলামেও ভেজাল ঢুকেছে। এ ভেজাল হলো শিরক, বিদআত ও কুফরী। ইবাদাতের নামে চলছে নানা বিদআত। তার মধ্যে একটি হলো দুআ ও যিক্র। দুআ ও যিক্র করার নিয়ম রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এবং সাহাবায়ে কিরাম রাদিয়াল্লাহু আনহুম হতে স্পষ্টভাবে বর্ণিত রয়েছে। কোন সময় কোন স্থানে কি যিক্র ও দুআ করতে হবে তা হাদীসে উল্লেখ রয়েছে।',
    "হজ্জে যেতে ইচ্ছুক আমার ভাই/বোন! আপনাকে স্বাগতম। ভালো একটি সিদ্ধান্ত নিতে পেরেছেন। হজ্জে যাওয়ার সিদ্ধান্ত নিয়েছেন। হজ্জে যাওয়ার নিয়ত করেছেন। হজ্জের প্রতিদান কী? আপনি জানেন। আমাদের জীবনের সবচেয়ে চাওয়া পাওয়া আল্লাহকে খুশী করে জান্নাত লাভ করা। রাসূলুল্লাহ সাল্লাল্লাহু 'আলাইহি ওয়াসাল্লাম বলেছেন, *মাবরূর হজ্জের প্রতিদান শুধুমাত্র জান্নাত'। আর এ জান্নাতের পরিচয় আপনি জানেন। সবচেয়ে ছোট জান্নাত হবে দশটি দুনিয়ার সমান। আর সেখানকার নাজনিয়ামত হবে দুনিয়ার নাজ নিয়ামতের চেয়ে কমপক্ষে দশগুণ। বরং আরো অনেক বেশি।\nআল্লাহর মেহমান ভাই/বোন! বলুন তো ঢাকা শহরে একটি বাড়ি করার জন্য কতো বেশি মেহনত করতে হয়? কতো বেশি বুদ্ধি খাটাতে হয়? কতো বেশি হেকমত কৌশল খাটাতে হয়। কতো বেশি চেষ্টা করতে হয়। কতো বেশি শ্রম দিতে হয়। কতো বেশি সচেতন থাকতে হয়। কতো বেশি অর্থ ব্যয় করতে হয়। ছোট্ট একটি বাড়ি করার জন্য এতো মেহনত, এতো হেকমত, এতো চেষ্টা সাধনা, এতো অর্থ ব্যয়! তাহলে দশটি দুনিয়ার সমান একটি জান্নাত পেতে আমাদের কতো বেশি মেহনত, হেকমত চেষ্টা সাধনা করা উচিত। কতো বেশি সচেতন থাকা উচিত।"
  ];
}

class VideoDetailsFromAuthor {
  static List<String> videoTitle = [
    "দাওয়াতী ক্লাস",
    "১ম ক্লাস: (١) আলিফ দিয়ে আট হুরুফ শিক্ষা ",
    "২য় ক্লাস: (ب) বা দিয়ে সাত হুরুফ শিক্ষা ",
    "৩য় ক্লাস: (س) সীন দিয়ে সাত হুরুফ শিক্ষা ",
    "একশব্দে মুআল্লিম হওয়ার কৌশল ",
    "৪র্থ ক্লাস: (ء) হামজাহ দিয়ে সাত হুরুফ শিক্ষা ",
    "৫ম ক্লাস (١) আলিফের সাথে আমার মুরাক্কাব শিক্ষা",
    "৬ষ্ঠ ক্লাস: একশব্দে হুরুফ শিক্ষা ",
    "৭ম ক্লাস: একশব্দে হারাকাত শিক্ষা-১",
    "৮ম ক্লাস: একশব্দে হারাকাত শিক্ষা-২",
    "৯ম ক্লাস: একশব্দে হারাকাতের উচ্চারণের পার্থক্য ",
    "১১ তম ক্লাস: একশব্দে জজম শিক্ষা, ক্বলকলার পরিচয় এবং যজমের উচ্চারণের পার্থক্য পড়ানো ",
    "১২ তম ক্লাস: একশব্দে মাদ শিক্ষা তিনটি বর্ণের মাধ্যমে ১৭৪ টি মাদ শিক্ষা ",
    "১৩ তম ক্লাস: একশব্দে তাশদীদ শিক্ষা",
    "১৪ তম ক্লাস: লীনের হুরূফ শিক্ষা ",
    "১৫ তম ক্লাস: একশব্দে তাশদিদ শিক্ষা, সকল গুনাহ শিক্ষা এবং ঈদের উচ্চারণের পার্থক্য পড়ানো",
    "১৬ তম ক্লাস: বিসমিল্লাহির রাহমানির রাহিম পড়ানো ",
  ];
  static List<String> videoDescription = [
    "কুয়েত প্রবাসীদের কে নিয়ে দাওয়াতী ক্লাস। ১৪তম ক্লাস লীনের হুরূফ ও সকল মাদ শিক্ষা ব্যাচ-১৭৮",
    "কুয়েত প্রবাসীদের কে নিয়ে ১ম ক্লাস ا আলিফ দিয়ে আট হুরূফ শিক্ষা ব্যাচ-১৭৮",
    "২য় ক্লাস ب বা দিয়ে সাত হুরূফ শিক্ষা ব্যাচ-১৭৮",
    "৩য় ক্লাস س সীন দিয়ে সাত হুরূফ শিক্ষা ব্যাচ-১৭৮",
    "কুয়েত প্রবাসীদেরকে নিয়ে একশব্দে মুআ’ল্লিম হওয়ার কৌশল",
    "৪র্থ ক্লাস ء হামজাহ দিয়ে সাত হরফ শিক্ষা ব্যাচ-১৭৮",
    "কুয়েত প্রবাসীদের কে নিয়ে ক্লাস ا আলিফের সাথে মুরাক্কাব শিক্ষা ব্যাচ-১৭৮",
    "কুয়েত প্রবাসীদের কে নিয়ে ৬ষ্ট ক্লাস একশব্দে হুরূফ শিক্ষা ব্যাচ-১৭৮",
    "কুয়েত প্রবাসীদের কে নিয়ে ৭ম ক্লাস একশব্দে হারাকাত শিক্ষা-১ ব্যাচ-১৭৮",
    "কুয়েত প্রবাসীদের কে নিয়ে ৮ম ক্লাস একশব্দে হারাকাত শিক্ষা-২ ব্যাচ-১৭৮",
    "কুয়েত প্রবাসীদের কে নিয়ে ৯ম ক্লাস একশব্দে হারাকাতের উচ্চারণের পার্থক্য ব্যাচ-১৭৮",
    "১১ তম ক্লাস একশব্দে জযম শিক্ষা, ক্বলকলার পরিচয় এবং জযমের উচ্চারনের পার্থক্য পড়ানো ব্যাচ-১৭৮",
    "১২ তম ক্লাস একশব্দে মাদ শিক্ষা, ৩ টি বর্ণের মাধ্যমে ১৭৪ মাদ শিক্ষা করা ব্যাচ-১৭৮",
    "১৩ তম ক্লাসঃ একশব্দে তাশদীদ শিক্ষা- জেদ্দা (01715 125 125)",
    "১৪ তম ক্লাসঃ লীনের হুরূফ ও সকল মাদ শিক্ষা , ক্লাসঃ বাংলাদেশ-সিঙ্গাপুর-ওমান, ব্যাচ-১৭৬",
    "১৫ তম ক্লাস: একশব্দে তাশদীদ শিক্ষা , সকল গুন্নাহ শিক্ষা এবং তাশদীদের উচ্চারনের পাথর্ক্য পড়ানো",
    "কুয়েত প্রবাসীদের কে নিয়ে দাওয়াতী ক্লাস। ১৪তম ক্লাস লীনের হুরূফ ও সকল মাদ শিক্ষা ব্যাচ-১৭৮",
  ];
  static List<String> videoUrl = [
    "https://youtu.be/E4Q3gHUuS7g?si=laSWkPsKkQ5MeacL",
    "https://youtu.be/-cusjlCSN4w?si=dBhqY-eRkGeHz6Sv",
    "https://youtu.be/1tKf8Awrd_A?si=xzpVL3ybp0ZFttGh",
    "https://youtu.be/gSwcAoRRknc?si=nww9Hy0GZibJvw_Y",
    "https://youtu.be/K4fwsS5oKIw?si=etM9YB45iYLql_lX",
    "https://youtu.be/fuj_mpKT8q8?si=O4vTYyaseLK7kxRt",
    "https://youtu.be/xo7QbYz9ZIU?si=dKLJYi_oTm3iOz-E",
    "https://youtu.be/D1-rEPhbq7s?si=LDd9flgBs0fq-SxW",
    "https://youtu.be/rIgpJrscECA?feature=shared",
    "https://youtu.be/ewjK-EX2TsI?si=5bYr6zgXSd_oR8MV",
    "https://youtu.be/sXA4WsNDSXc?si=x-ubwluUSst4k9jl",
    "https://youtu.be/NypjxIgdRvY?si=wvh6RXgVuNHNopen",
    "https://youtu.be/a_61m-95uMo?si=YH_WqG8JYYbFjwZj",
    "https://youtu.be/sYiATJxM9i4?si=VCRnveFwX4PVtfsZ",
    "https://youtu.be/ql2SyZcH_fM?si=QFdu0KM03LViJkQk",
    "https://youtu.be/7jvh7Ts40Uw?si=nsZzHmtwSlQiDY--",
    "https://youtu.be/E4Q3gHUuS7g?si=laSWkPsKkQ5MeacL",
  ];
  static List<String> videoImage = [
    "https://img.youtube.com/vi/E4Q3gHUuS7g/0.jpg",
    "https://img.youtube.com/vi/-cusjlCSN4w/0.jpg",
    "https://img.youtube.com/vi/1tKf8Awrd_A/0.jpg",
    "https://img.youtube.com/vi/gSwcAoRRknc/0.jpg",
    "https://img.youtube.com/vi/K4fwsS5oKIw/0.jpg",
    "https://img.youtube.com/vi/fuj_mpKT8q8/0.jpg",
    "https://img.youtube.com/vi/xo7QbYz9ZIU/0.jpg",
    "https://img.youtube.com/vi/D1-rEPhbq7s/0.jpg",
    "https://img.youtube.com/vi/rIgpJrscECA/0.jpg",
    "https://img.youtube.com/vi/ewjK-EX2TsI/0.jpg",
    "https://img.youtube.com/vi/sXA4WsNDSXc/0.jpg",
    "https://img.youtube.com/vi/NypjxIgdRvY/0.jpg",
    "https://img.youtube.com/vi/a_61m-95uMo/0.jpg",
    "https://img.youtube.com/vi/sYiATJxM9i4/0.jpg",
    "https://img.youtube.com/vi/ql2SyZcH_fM/0.jpg",
    "https://img.youtube.com/vi/7jvh7Ts40Uw/0.jpg",
    "https://img.youtube.com/vi/E4Q3gHUuS7g/0.jpg"
  ];
}
