class BookDetailsFromAuthors {
 static List<String> bookImage = [
  'book1.jpeg',
  'book2.jpeg',
  'book3.jpeg',
  'book4.png',
];

static List<String> authorName = [
  "শাইখ আবুল হাসানাত মুহাম্মাদ ইমদাদুল্লাহ",
  "শাইখ আবুল হাসানাত মুহাম্মাদ ইমদাদুল্লাহ",
  "শাইখ আবুল হাসানাত মুহাম্মাদ ইমদাদুল্লাহ",
  "শাইখ আবুল হাসানাত মুহাম্মাদ ইমদাদুল্লাহ"
];

static List<int> bookPrice = [100, 150, 340, 100];

static List<String> bookProkashoni = [
  "আধুনিক প্রকাশনী",
  "আধুনিক প্রকাশনী",
  "আধুনিক প্রকাশনী",
  "আধুনিক প্রকাশনী"
];

static List<String> bookSubject = ["", "", "", ""];
static List<String> bookTranslator = ["", "", "", ""];
static List<String> bookCover = [
  "পেপার ব্যাক",
  "পেপার ব্যাক",
  "পেপার ব্যাক",
  "পেপার ব্যাক"
];
static List<String> bookLanguage = ["বাংলা", "বাংলা", "বাংলা", "বাংলা"];
static List<String> bookEdition = ["১ম", "১০ম", "৫ম", "৫ম"];
static List<int> bookTotalPage = [32, 224, 386, 120];

static List<String> bookName = [
  "একশব্দে কুরআন শিক্ষা",
  "একশব্দে কুরআন শিখানোর সুন্দর কৌশল",
  "জিকির ও দোয়া",
  "একশব্দে হজ্জ ও উমরাহ শিক্ষা"
];

static List<String> booDescription = [
  'তোমাদের মধ্যে আল্লাহর নিকট সেই ব্যক্তি সর্বাপেক্ষা মর্যাদাসম্পন্ন, যে তোমাদের মধ্যে সর্বাপেক্ষা মুত্তাকি। নিশ্চয় আল্লাহ সবকিছু জানেন, সকল ব্যাপারে অবহিত।তাকওয়াই হলো শ্রেষ্ঠত্বের উৎস, উত্তম চরিত্রাবলির কেন্দ্রবিন্দু। যেমন দয়া, অঙ্গীকার পূর্ণ করা, সত্যবাদিতা, ন্যায়পরায়ণতা, আত্মসংযম, শরিয়ত নির্দেশিত কাজে ব্যয় করা, দানসদকা, হাদিয়া তথা এ প্রকারের যত উত্তম গুণাবলি রয়েছে, এগুলো তাকওয়া ও আল্লাহভীতিরই শাশ্বত ফলাফল। এই তাকওয়াই মানুষের নির্জনতার একমাত্র সঙ্গী ও ধ্বংস থেকে মুক্তিদানকারী।তোমাদের মধ্যে আল্লাহর নিকট সেই ব্যক্তি সর্বাপেক্ষা মর্যাদাসম্পন্ন, যে তোমাদের মধ্যে সর্বাপেক্ষা মুত্তাকি। নিশ্চয় আল্লাহ সবকিছু জানেন, সকল ব্যাপারে অবহিত।তাকওয়াই হলো শ্রেষ্ঠত্বের উৎস, উত্তম চরিত্রাবলির কেন্দ্রবিন্দু। যেমন দয়া, অঙ্গীকার পূর্ণ করা, সত্যবাদিতা, ন্যায়পরায়ণতা, আত্মসংযম, শরিয়ত নির্দেশিত কাজে ব্যয় করা, দানসদকা, হাদিয়া তথা এ প্রকারের যত উত্তম গুণাবলি রয়েছে, এগুলো তাকওয়া ও আল্লাহভীতিরই শাশ্বত ফলাফল। এই তাকওয়াই মানুষের নির্জনতার একমাত্র সঙ্গী ও ধ্বংস থেকে মুক্তিদানকারী।',
  'তোমাদের মধ্যে আল্লাহর নিকট সেই ব্যক্তি সর্বাপেক্ষা মর্যাদাসম্পন্ন, যে তোমাদের মধ্যে সর্বাপেক্ষা মুত্তাকি। নিশ্চয় আল্লাহ সবকিছু জানেন, সকল ব্যাপারে অবহিত।তাকওয়াই হলো শ্রেষ্ঠত্বের উৎস, উত্তম চরিত্রাবলির কেন্দ্রবিন্দু। যেমন দয়া, অঙ্গীকার পূর্ণ করা, সত্যবাদিতা, ন্যায়পরায়ণতা, আত্মসংযম, শরিয়ত নির্দেশিত কাজে ব্যয় করা, দানসদকা, হাদিয়া তথা এ প্রকারের যত উত্তম গুণাবলি রয়েছে, এগুলো তাকওয়া ও আল্লাহভীতিরই শাশ্বত ফলাফল। এই তাকওয়াই মানুষের নির্জনতার একমাত্র সঙ্গী ও ধ্বংস থেকে মুক্তিদানকারী।তোমাদের মধ্যে আল্লাহর নিকট সেই ব্যক্তি সর্বাপেক্ষা মর্যাদাসম্পন্ন, যে তোমাদের মধ্যে সর্বাপেক্ষা মুত্তাকি। নিশ্চয় আল্লাহ সবকিছু জানেন, সকল ব্যাপারে অবহিত।তাকওয়াই হলো শ্রেষ্ঠত্বের উৎস, উত্তম চরিত্রাবলির কেন্দ্রবিন্দু। যেমন দয়া, অঙ্গীকার পূর্ণ করা, সত্যবাদিতা, ন্যায়পরায়ণতা, আত্মসংযম, শরিয়ত নির্দেশিত কাজে ব্যয় করা, দানসদকা, হাদিয়া তথা এ প্রকারের যত উত্তম গুণাবলি রয়েছে, এগুলো তাকওয়া ও আল্লাহভীতিরই শাশ্বত ফলাফল। এই তাকওয়াই মানুষের নির্জনতার একমাত্র সঙ্গী ও ধ্বংস থেকে মুক্তিদানকারী।',
  'তোমাদের মধ্যে আল্লাহর নিকট সেই ব্যক্তি সর্বাপেক্ষা মর্যাদাসম্পন্ন, যে তোমাদের মধ্যে সর্বাপেক্ষা মুত্তাকি। নিশ্চয় আল্লাহ সবকিছু জানেন, সকল ব্যাপারে অবহিত।তাকওয়াই হলো শ্রেষ্ঠত্বের উৎস, উত্তম চরিত্রাবলির কেন্দ্রবিন্দু। যেমন দয়া, অঙ্গীকার পূর্ণ করা, সত্যবাদিতা, ন্যায়পরায়ণতা, আত্মসংযম, শরিয়ত নির্দেশিত কাজে ব্যয় করা, দানসদকা, হাদিয়া তথা এ প্রকারের যত উত্তম গুণাবলি রয়েছে, এগুলো তাকওয়া ও আল্লাহভীতিরই শাশ্বত ফলাফল। এই তাকওয়াই মানুষের নির্জনতার একমাত্র সঙ্গী ও ধ্বংস থেকে মুক্তিদানকারী।তোমাদের মধ্যে আল্লাহর নিকট সেই ব্যক্তি সর্বাপেক্ষা মর্যাদাসম্পন্ন, যে তোমাদের মধ্যে সর্বাপেক্ষা মুত্তাকি। নিশ্চয় আল্লাহ সবকিছু জানেন, সকল ব্যাপারে অবহিত।তাকওয়াই হলো শ্রেষ্ঠত্বের উৎস, উত্তম চরিত্রাবলির কেন্দ্রবিন্দু। যেমন দয়া, অঙ্গীকার পূর্ণ করা, সত্যবাদিতা, ন্যায়পরায়ণতা, আত্মসংযম, শরিয়ত নির্দেশিত কাজে ব্যয় করা, দানসদকা, হাদিয়া তথা এ প্রকারের যত উত্তম গুণাবলি রয়েছে, এগুলো তাকওয়া ও আল্লাহভীতিরই শাশ্বত ফলাফল। এই তাকওয়াই মানুষের নির্জনতার একমাত্র সঙ্গী ও ধ্বংস থেকে মুক্তিদানকারী।',
  'তোমাদের মধ্যে আল্লাহর নিকট সেই ব্যক্তি সর্বাপেক্ষা মর্যাদাসম্পন্ন, যে তোমাদের মধ্যে সর্বাপেক্ষা মুত্তাকি। নিশ্চয় আল্লাহ সবকিছু জানেন, সকল ব্যাপারে অবহিত।তাকওয়াই হলো শ্রেষ্ঠত্বের উৎস, উত্তম চরিত্রাবলির কেন্দ্রবিন্দু। যেমন দয়া, অঙ্গীকার পূর্ণ করা, সত্যবাদিতা, ন্যায়পরায়ণতা, আত্মসংযম, শরিয়ত নির্দেশিত কাজে ব্যয় করা, দানসদকা, হাদিয়া তথা এ প্রকারের যত উত্তম গুণাবলি রয়েছে, এগুলো তাকওয়া ও আল্লাহভীতিরই শাশ্বত ফলাফল। এই তাকওয়াই মানুষের নির্জনতার একমাত্র সঙ্গী ও ধ্বংস থেকে মুক্তিদানকারী।তোমাদের মধ্যে আল্লাহর নিকট সেই ব্যক্তি সর্বাপেক্ষা মর্যাদাসম্পন্ন, যে তোমাদের মধ্যে সর্বাপেক্ষা মুত্তাকি। নিশ্চয় আল্লাহ সবকিছু জানেন, সকল ব্যাপারে অবহিত।তাকওয়াই হলো শ্রেষ্ঠত্বের উৎস, উত্তম চরিত্রাবলির কেন্দ্রবিন্দু। যেমন দয়া, অঙ্গীকার পূর্ণ করা, সত্যবাদিতা, ন্যায়পরায়ণতা, আত্মসংযম, শরিয়ত নির্দেশিত কাজে ব্যয় করা, দানসদকা, হাদিয়া তথা এ প্রকারের যত উত্তম গুণাবলি রয়েছে, এগুলো তাকওয়া ও আল্লাহভীতিরই শাশ্বত ফলাফল। এই তাকওয়াই মানুষের নির্জনতার একমাত্র সঙ্গী ও ধ্বংস থেকে মুক্তিদানকারী।'
];
}
