import 'package:flutter/material.dart';

class AboutUs extends StatefulWidget {
  const AboutUs({super.key});

  @override
  State<AboutUs> createState() => _AboutUsState();
}

class _AboutUsState extends State<AboutUs> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          flexibleSpace: const Image(
            image: AssetImage(
                'assets/images/toprectangle.png'), // Replace with your image path
            fit: BoxFit.cover,
          ),
          foregroundColor: Colors.white,
          title: const Text('আমাদের সম্পর্কে'),
          centerTitle: true,
        ),
        body: const SingleChildScrollView(
            child: Padding(
          padding: EdgeInsets.all(10.0),
          child: Column(
            children: [
              SizedBox(
                height: 20,
              ),
              Text(
                "সংক্ষিপ্ত পরিচিতি",
                style: TextStyle(
                  fontSize: 20,
                  fontWeight: FontWeight.bold,
                ),
              ),
              Text(
                "'কুরআন শিক্ষা ফাউন্ডেশন' গণপ্রজাতন্ত্রী বাংলাদেশ সরকারের বিধি মোতাবেক নিবন্ধিত একটি শিক্ষামূলক, গবেষণাধর্মী, সেবামূলক ও অরাজনৈতিক প্রতিষ্ঠান। ১৯৯৩ সাল থেকে প্রতিষ্ঠানটি সকল পেশার মানুষের মাঝে অবিরাম কুরআন শিক্ষার কাজ করে চলেছে।\nদয়াময় আল্লাহ রাব্বুল আলামীনের পক্ষ থেকে মানব জাতির পথ প্রদর্শনের জন্যে প্রেরিত আলকুরআনের “সহীহ তিলাওয়াত, অনুধাবন, অনুশীলন ও দাওয়াত” আমাদের মিশন। সহীহ করে কুরআন তিলাওয়াত করা ফরজ্। আমাদের দেশে সহজে শুদ্ধভাবে কুরআন তিলাওয়াত শিক্ষার উপায় নিয়ে অনেকেই কাজ করছেন।\nএই বিষয়ে গবেষক কুরআন শিক্ষা ফাউন্ডেশনের সম্মানিত চেয়ারম্যান আবুল হাসানাত মুহাম্মাদ ইমদাদুললাহ এর সুদীর্ঘ গবেষণার ফসল ‘একশব্দে কুরআন শিক্ষা’ পদ্ধতি। এই পদ্ধতিতে যেকোন বয়সের মানুষ ৯টি হরুফের মাধ্যমে নিবিড় চেষ্টায় আলকুরআন সহীহ করে পড়তে পারেন। ২৩ বছর ধরে দেশে-বিদেশে হাজার-হাজার মানুষ এই পদ্ধতির মাধ্যমে কুরআন শিখে চলেছেন। এছাড়া দেশের স্বনামধন্য বেসরকারী টিভি চ্যানেল এনটিভি ২০০৩ সাল থেকে প্রতিদিন ভোর ৫.২৫মিনিটে এ প্রোগ্রামটি সম্প্রচার করে চলছে।\n",
                textAlign: TextAlign.center,
              ),
              Text(
                "একশব্দে কুরআন শিক্ষা কি?",
                style: TextStyle(
                  fontSize: 20,
                  fontWeight: FontWeight.bold,
                ),
              ),
              Text(
                  "১) একশব্দ ৯টি সূরতের ২৯টি হরফের (বর্ণমালার) সমষ্টি। একশব্দের মাধ্যমেই অনায়াসেই যে কোন ব্যক্তি হরফগুলো পড়তে, বলতে ও বুঝতে পারেন এবং সাথে সাথে মনে রাখতে ও আত্মস্থ করতে পারেন। আর এ পদ্ধতিতে সহজে সহীহ শুদ্ধভাবে কুরআন তিলাওয়াত শিখে ৩০ পারা তিলাওয়াত করতে পারেন, আল-হামদুলিল্লাহ। জনাব আবুল হাসানাত মুহাম্মদ ইমদাদুল্লাহ এর উদ্ভাবিত এ পদ্ধতির নামকরণ করা হয়েছে ‘একশব্দে কুরআন শিক্ষা’।\n২) একশব্দের মাধ্যমে হরূফ, হারাকাত, মাদ, ছুকুন ও তাশদীদ শেখা যয়। শুধু ‘আলিফ’ দিয়ে ৮টি হরূফ শেখা যায়। একই ভাবে মাত্র ৯টি সূরত দিয়ে কুরআনের ২৯টি হরূফ শেখা যায়। ৩টি হরূফের মধ্যে ১৭৪টি মাদ পড়া যায়। ইহা বুঝতে পারলে কুরআনের প্রায় সাড়ে সাত পারা সহীহ করে পড়া যায়।\n৩) শুনতে একরকম মনে হলেও আসলে একরকম নয়, উচ্চারণে পার্থক্য হয়, অর্থের পরিবর্তন হয়ে যায়। যেমন: جا- ظا- ذا- زا এভাবে উচ্চারণে কাছাকাছি হরফ গুলোকে ৮ ভাগে ভাগ করে মাশ্কের মাধ্যমে উচ্চারণ সহীহ করা যায়।\n"),
              Text(
                "কুরআন শিক্ষা ফাউন্ডেশনের প্রকল্পসমূহ",
                style: TextStyle(
                  fontSize: 20,
                  fontWeight: FontWeight.bold,
                ),
              ),
              Text(
                  "আমাদের মিশন- কুরআনের আলোকে আলোকিত জীবন। এই হেরার আলো বাংলাদেশসহ সারা পৃথিবীর মানুষের কাছে পৌঁছে দেয়ার লক্ষ্যে আমরা বিভিন্ন প্রকল্প নিয়ে কাজ শুরু করেছি। আমাদের প্রকল্পসমূহ নিম্নরুপ।"),
              Text("আমাদের প্রকল্পসমূহ:"),
              Text(
                  "১) সহীহ্ তিলাওয়াত, অনুধাবন, অনুশীলন ও দাওয়াত।\n২) মুয়াল্লিম ও মুয়াল্লিমাহ তারবীয়াহ কোর্স (শিক্ষক প্রশিক্ষণ)।\n৩) প্রত্যেক জেলায় মুয়াল্লিম ও মুবাল্লিগ স্পন্সরিং।\n৪) একশব্দের সারাদিনের মক্তব ও কুরআনিয়া মাদ্রাসা।\n৫) তালিমুস সালাত কোর্স।\n৬) আলকুরআনের পরিবার সদস্য মজলিশ।\n৭) মিডিয়ায় কুরআন সম্প্রচার।\n৮) বিষয় ভিত্তিক বই, ভিসিডি ও ষ্টীকার প্রকাশ।\n৯) স্থায়ী কুরআন গবেষণা কমপ্লেক্স নির্মাণ।\n১০) মাসজিদ নির্মান ও খতিব নিয়োগ।"),
              SizedBox(
                height: 20,
              )
            ],
          ),
        )));
  }
}
